In [14]:
import pandas as pd
import numpy as np

Series

In [15]:
benimSozlugum = {"Atil" : 50, "Zeynep" : 40, "Mehmet" : 30}

In [16]:
pd.Series(benimSozlugum)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [17]:
benimYaslarim = [50,40,30]
benimIsimlerim = ["Atil", "Zeynep", "Mehmet"]

In [18]:
pd.Series(benimYaslarim)

0    50
1    40
2    30
dtype: int64

In [19]:
pd.Series(benimYaslarim, benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [20]:
pd.Series(data=benimYaslarim, index=benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [21]:
numpyDizisi = np.array([50,40,30])

In [22]:
numpyDizisi

array([50, 40, 30])

In [23]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
dtype: int32

In [24]:
pd.Series(numpyDizisi,benimIsimlerim)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [25]:
pd.Series(["Baran","Salih","Orhan"],[1,2,3])

1    Baran
2    Salih
3    Orhan
dtype: object

In [26]:
 yarismaSonucu1 = pd.Series([10,5,1],["Baran","Salih","Orhan"])

In [27]:
yarismaSonucu1

Baran    10
Salih     5
Orhan     1
dtype: int64

In [28]:
yarismaSonucu2 = pd.Series([20,10,8],["Baran","Salih","Orhan"])

In [29]:
yarismaSonucu2

Baran    20
Salih    10
Orhan     8
dtype: int64

In [30]:
yarismaSonucu2["Salih"]

10

In [31]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [32]:
sonSonuc

Baran    30
Salih    15
Orhan     9
dtype: int64

In [33]:
farkliSeries = pd.Series([20,30,40,50],["a","b","c","d"])

In [34]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [35]:
farkliSeries + farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

Dataframe

In [36]:
data = np.random.randn(4,3)

In [37]:
data

array([[ 1.53329131, -1.57843148, -1.50002561],
       [ 0.43008988,  0.29264649,  1.80119604],
       [ 0.76512951, -1.00613594, -1.1684717 ],
       [-0.8369266 ,  0.16733368, -0.27279353]])

In [38]:
dataFrame = pd.DataFrame(data)

In [39]:
dataFrame

          0         1         2
0  1.533291 -1.578431 -1.500026
1  0.430090  0.292646  1.801196
2  0.765130 -1.006136 -1.168472
3 -0.836927  0.167334 -0.272794

In [40]:
dataFrame[0]

0    1.533291
1    0.430090
2    0.765130
3   -0.836927
Name: 0, dtype: float64

In [41]:
type(dataFrame)

pandas.core.frame.DataFrame

In [42]:
yeniDataFrame = pd.DataFrame(data,index=["Baran","Salih","Orhan","Berkay"],columns = ["Maas","Yas","Calisma Saati"])

In [43]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [44]:
yeniDataFrame["Yas"]

Baran    -1.578431
Salih     0.292646
Orhan    -1.006136
Berkay    0.167334
Name: Yas, dtype: float64

In [45]:
yeniDataFrame[["Maas","Calisma Saati"]]

            Maas  Calisma Saati
Baran   1.533291      -1.500026
Salih   0.430090       1.801196
Orhan   0.765130      -1.168472
Berkay -0.836927      -0.272794

In [46]:
yeniDataFrame.loc["Baran"]

Maas             1.533291
Yas             -1.578431
Calisma Saati   -1.500026
Name: Baran, dtype: float64

In [47]:
yeniDataFrame.iloc[1]

Maas             0.430090
Yas              0.292646
Calisma Saati    1.801196
Name: Salih, dtype: float64

In [48]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [49]:
yeniDataFrame["Maas"]

Baran     1.533291
Salih     0.430090
Orhan     0.765130
Berkay   -0.836927
Name: Maas, dtype: float64

In [50]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [51]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Baran   1.533291 -1.578431      -1.500026       -3.156863
Salih   0.430090  0.292646       1.801196        0.585293
Orhan   0.765130 -1.006136      -1.168472       -2.012272
Berkay -0.836927  0.167334      -0.272794        0.334667

In [52]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [53]:
yeniDataFrame.drop("Berkay")

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Baran  1.533291 -1.578431      -1.500026       -3.156863
Salih  0.430090  0.292646       1.801196        0.585293
Orhan  0.765130 -1.006136      -1.168472       -2.012272

In [54]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Baran   1.533291 -1.578431      -1.500026       -3.156863
Salih   0.430090  0.292646       1.801196        0.585293
Orhan   0.765130 -1.006136      -1.168472       -2.012272
Berkay -0.836927  0.167334      -0.272794        0.334667

In [55]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [56]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [57]:
yeniDataFrame.loc["Baran"]["Yas"]

-1.5784314795048735

In [58]:
yeniDataFrame.loc["Baran","Yas"]

-1.5784314795048735

In [59]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [60]:
boolean = yeniDataFrame < 0

In [61]:
boolean

         Maas    Yas  Calisma Saati
Baran   False   True           True
Salih   False  False          False
Orhan   False   True           True
Berkay   True  False           True

In [62]:
yeniDataFrame[boolean]

            Maas       Yas  Calisma Saati
Baran        NaN -1.578431      -1.500026
Salih        NaN       NaN            NaN
Orhan        NaN -1.006136      -1.168472
Berkay -0.836927       NaN      -0.272794

In [63]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Baran        NaN -1.578431      -1.500026
Salih        NaN       NaN            NaN
Orhan        NaN -1.006136      -1.168472
Berkay -0.836927       NaN      -0.272794

In [64]:
yeniDataFrame["Yas"] > 0

Baran     False
Salih      True
Orhan     False
Berkay     True
Name: Yas, dtype: bool

In [65]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati
Salih   0.430090  0.292646       1.801196
Berkay -0.836927  0.167334      -0.272794

In [66]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [67]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0   Baran  1.533291 -1.578431      -1.500026
1   Salih  0.430090  0.292646       1.801196
2   Orhan  0.765130 -1.006136      -1.168472
3  Berkay -0.836927  0.167334      -0.272794

In [68]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Baran   1.533291 -1.578431      -1.500026
Salih   0.430090  0.292646       1.801196
Orhan   0.765130 -1.006136      -1.168472
Berkay -0.836927  0.167334      -0.272794

In [69]:
yeniIndeksListesi = ["Bar","Sal","Orh","Ber"]

In [70]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [71]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Baran   1.533291 -1.578431      -1.500026         Bar
Salih   0.430090  0.292646       1.801196         Sal
Orhan   0.765130 -1.006136      -1.168472         Orh
Berkay -0.836927  0.167334      -0.272794         Ber

In [72]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Bar          1.533291 -1.578431      -1.500026
Sal          0.430090  0.292646       1.801196
Orh          0.765130 -1.006136      -1.168472
Ber         -0.836927  0.167334      -0.272794

In [73]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Baran   1.533291 -1.578431      -1.500026         Bar
Salih   0.430090  0.292646       1.801196         Sal
Orhan   0.765130 -1.006136      -1.168472         Orh
Berkay -0.836927  0.167334      -0.272794         Ber

In [74]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [75]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Bar          1.533291 -1.578431      -1.500026
Sal          0.430090  0.292646       1.801196
Orh          0.765130 -1.006136      -1.168472
Ber         -0.836927  0.167334      -0.272794

In [76]:
yeniDataFrame.loc["Bar"]

Maas             1.533291
Yas             -1.578431
Calisma Saati   -1.500026
Name: Bar, dtype: float64

In [77]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park"]

In [78]:
icIndeksler = ["Homer","Bart","Merge","Cartman","Kenny","Kyle"]

In [79]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [80]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny')]

GROUPBY

In [84]:
maasSozlugu = {"Departmanlar" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Çalışan İsmi" : ["Ahmet", "Mehmet","Atıl","Burak","Zeynep","Fatma"],
             "Maas" : [100,150,200,300,400,500]
             }

In [85]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [86]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maas
0      Yazılım        Ahmet   100
1      Yazılım       Mehmet   150
2    Pazarlama         Atıl   200
3    Pazarlama        Burak   300
4        Hukuk       Zeynep   400
5        Hukuk        Fatma   500

In [90]:
grupObjesi = maasDataFrame.groupby("Departmanlar")

In [91]:
grupObjesi.count()

              Çalışan İsmi  Maas
Departmanlar
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [92]:
grupObjesi.mean()

C:\Users\bct\AppData\Local\Temp\ipykernel_20444\104408460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean()

               Maas
Departmanlar
Hukuk         450.0
Pazarlama     250.0
Yazılım       125.0

In [94]:
grupObjesi.min()

             Çalışan İsmi  Maas
Departmanlar
Hukuk               Fatma   400
Pazarlama            Atıl   200
Yazılım             Ahmet   100

In [95]:
grupObjesi.max()

             Çalışan İsmi  Maas
Departmanlar
Hukuk              Zeynep   500
Pazarlama           Burak   300
Yazılım            Mehmet   150

In [96]:
grupObjesi.describe()

              Maas
             count   mean        std    min    25%    50%    75%    max
Departmanlar
Hukuk          2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama      2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım        2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

Pandas Operasyonları "Concat"